# Period Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
Curve..::..Period Property
Curve Class See Also
---
The period of this curve.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public double Period { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Period As Double
	Get
```

Visual C++
---
```text
public:
property double Period {
	double get ();
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | Thrown when the curve is not cyclic. |

# See Also
Curve Class
Autodesk.Revit.DB Namespace